app/controllers/eleves_controller.rb

SELECT COUNT(*) FROM "eleves"
INSERT INTO "eleves" ("creation", "prenom", "datenaissance", "ville", "cp", "diplome", "situationpro", "institution", "logement", "allocataire", "bourse", "latitude", "longitude") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def index
    @prout = Eleve.tabash
    if Eleve.count < 50
      @prout.each { |eleve| Eleve.create(eleve) }

SELECT "eleves".* FROM "eleves"
SELECT COUNT(*) FROM "eleves"
---
  def show
    @moyennedage = Eleve.moyenage
    @eleves = Eleve.all
    @markers = @eleves.map do |eleve|
      {:latlng => [eleve.latitude , eleve.longitude]} if eleve.latitude && eleve.longitude
    end.compact
    @bourse = Eleve.bourse
    @inscription_par_date = Eleve.inscription_par_date
    @compteur = Eleve.count